[
  {
    "filename": "MyHealth at Stanford WHIPPLE SURGERY NOTES.pdf",
    "uploaded_at": 1765830244.6318839,
    "summary": "Hi James! I've reviewed your surgical pathology document for you.\n\n**Document Type & Date:** This is a pathology report from your Whipple surgery at Stanford, dated February 18, 2011.\n\n**Summary:** The good news is that your surgical team was able to completely remove the tumor with clear margins, meaning they got it all out successfully. The pathology confirmed it was an acinar cell carcinoma of the pancreas, which is a rare type of pancreatic cancer, and the detailed analysis shows the surgery achieved what they hoped for.\n\n**Key Findings in Plain English:**\n- **Tumor type:** Acinar cell carcinoma (a rare form of pancreatic cancer)\n- **Size:** About 8.5 cm (roughly 3.3 inches) \n- **Location:** In the head of your pancreas\n- **Margins:** All surgical margins were clear - this means the surgeons successfully removed all the cancerous tissue\n- **Lymph nodes:** Multiple lymph nodes were removed and examined as part of the procedure\n- **Other organs:** Your gallbladder was also removed and appeared normal\n- **Duodenum:** The small intestine portion showed no tumor involvement\n\nThe fact that all margins were clear is really encouraging - it means the surgical team was able to remove the entire tumor completely. This type of detailed pathology analysis helps your medical team plan the best next steps for your care.",
    "raw_text_preview": "About this test\n(https://mychart.stanfordhealthcare.org/myhealth_sso/Home/ContentRedirect?\nurlGuid=5daa57d190354e30b7a38c52f28f8a17&urlExtraInfo=WP-24Z-\n2BBBg5Omhv1AXs6R6xlUwz4-2BtW9jOozu17WCht-2BI-2FlI-3D-\n24q0MsfONF0xH1ZSxyDvSwDfwqK-2BomOyHNOYiA-2FljN2XU-3D)\nResults\nCOMPARE RESULT TRENDS (/MYHEALTH_SSO/APP/TEST-RESULTS/PAST-RESULT-DETAILS?\nEORDERID=WP-24J5ENCZGYNOG7TWQD-2F4-2FF1Q-3D-3D-24AUW1WVXJJVUT05P-\n2B4KOU53IOYJMOAQ8JFUJFYITCPUE-3D)\nCase Type\nValue\nSurgical General12/15/25, 12:23 PM Test "
  },
  {
    "filename": "UCSF MyChart - Past Visit Details.pdf",
    "uploaded_at": 1765818536.0182564,
    "summary": "Hi James! Let me break down your visit summary for you:\n\n## Document Details\n**Document Type:** UCSF MyChart Office Visit Summary  \n**Date:** June 17, 2025 (visit with Dr. Kendra Moore)\n\n## Summary\nGreat news - your abdominal pain has resolved with the combination of famotidine and pantoprazole! Dr. Moore was able to stop the Imodium and Bentyl since you're doing so much better. This was primarily a medication follow-up visit to check on your progress.\n\n## Key Findings in Plain English\n\n**The Good News:**\n- Your abdominal pain is completely resolved thanks to the acid-reducing medications\n- Your vital signs look great (blood pressure, heart rate, oxygen levels all normal)\n- You're feeling well overall and breathing comfortably\n- No pain reported during the visit\n\n**What's Being Monitored:**\n- You have a small lymph node that's grown slightly (from 0.8 to 1 cm) - Dr. Moore wants to keep an eye on this with a follow-up CT scan in 3 months\n- Your GERD (acid reflux) is being well-controlled with your current medications\n\n**The Plan Going Forward:**\n- Gradually reduce your pantoprazole and famotidine doses\n- Continue with dietary modifications\n- Follow-up CT scan in 3 months to monitor that lymph node\n- Keep taking your medications as prescribed for now\n\nOverall, this sounds like a very positive visit with your stomach issues much improved!",
    "raw_text_preview": "Name: James R Anderson | DOB: 8/20/1978 | MRN: 51098153 | PCP: Kendra Ann Moore, MD | Legal Name: James R Anderson\nOﬀice Visit - Jun 17, 2025\nwith Kendra Moore at UCSF Gen eral Medicine at 1545 Divisadero\nNotes from Care Team\nA Note to Patients: Symptoms are concisely summarized to inform treatment \nrecommendations. For reasons of privacy and brevity, this note does not attempt to \ncapture all experiences that were discussed.\n \n \n  \nJames R Anderson is a 46 y.o. male who presents with the follow"
  },
  {
    "filename": "UCSF MyChart - Test Details CBC.pdf",
    "uploaded_at": 1765830138.7833796,
    "summary": "Hi James! Let me break down your recent lab results for you.\n\n**Document Type & Date:**\nThis is a Complete Blood Count (CBC) with Differential from UCSF, collected on May 24, 2025.\n\n**Summary:**\nYour blood work shows a few values that are slightly outside the normal range, but overall your results look fairly good. The main things to note are that your white blood cell count is at the high end of normal, and there are some minor variations in specific types of white blood cells.\n\n**Key Findings in Plain English:**\n\n**Normal Results:**\n- Your red blood cell count, hemoglobin, and hematocrit are all in the healthy range - this means you're not anemic and your blood is carrying oxygen well\n- Your platelet count is normal, so your blood clotting ability is fine\n\n**Results to Note:**\n- **White Blood Cell Count**: 11.1 (slightly high) - This could indicate your body is fighting off something minor like a cold or infection\n- **Neutrophils**: 8.99 (slightly high) - These are infection-fighting cells, so this supports the idea your immune system might be active\n- **Lymphocytes**: 0.9 (slightly low) - Another type of immune cell that's a bit below normal\n- **Monocytes**: 0.83 (slightly high) - These help clean up infections and damaged tissue\n\nThese small abnormalities are often temporary and could be related to stress, a minor infection, or even just normal day-to-day variations. I'd recommend discussing these results with Dr. Moore to see if any follow-up is needed!",
    "raw_text_preview": "Name: James R Anderson | DOB: 8/20/1978 | MRN: 51098153 | PCP: Kendra Ann Moore, MD | Legal Name: James R Anderson\nCOMPLETE BLOOD COUNT WITH DIFFERENTIAL\nCollected on May 24, 2025 3:42 PM\nResults\nWBC Count\nNormal range: 3.4 - 10.0 x10E9/L\n3.4 1011.1 HighRBC Count\nNormal range: 4.40 - 5.90 x10E12/L\n4.4 5.95.42\nHemoglobin\nNormal range: 13.6 - 17.5 g/dL\n13.6 17.515.6Hematocrit\nNormal range: 41.0 - 53.0 %\n41 5346.5\nMCV\nNormal range: 80 - 100 fL\n80 10086MCH\nNormal range: 26.0 - 34.0 pg\n26 3428.8\nMCHC"
  },
  {
    "filename": "UCSF MyChart - Test Details UA.pdf",
    "uploaded_at": 1765830080.4959562,
    "summary": "Hi James! Here's what I found in your test results:\n\n## Document Summary\nThis is a **urinalysis with microscopy** from UCSF, collected on **September 22, 2025** at 4:16 PM.\n\n## What This Means\nGreat news - your urine test came back completely normal! All the markers they tested for came back negative or within healthy ranges, which means no signs of infection, kidney issues, or other concerns were detected.\n\n## Key Findings in Plain English\n- **Overall result**: Everything looks perfectly healthy\n- **No infection**: No bacteria, white blood cells, or other infection markers found\n- **Kidney function**: No protein or blood in urine, which indicates your kidneys are working well\n- **Blood sugar**: No glucose detected (normal)\n- **pH level**: 6.0, which is right in the healthy range\n- **Concentration**: Your urine concentration (specific gravity of 1.027) shows you're well-hydrated\n\nThe lab didn't even need to do the microscopic examination or culture because all the initial screening tests were so clearly normal. This is exactly the kind of result you want to see!",
    "raw_text_preview": "Name: James R Anderson | DOB: 8/20/1978 | MRN: 51098153 | PCP: Kendra Ann Moore, MD | Legal Name: James R Anderson\nURINALYSIS WITH MICROSCOPY, REFLEX TO CULTURE\nCollected on Sep 22, 2025 4:16 PM\nResults\nUrine Culture will only be performed if >10 WBCs per HPF are present on microscopic\nexamination.\nDoes not qualify for urine culture. Microscopy not done: negative hemoglobin, protein\nand WBC esterase.\nGlucose, UA\nNormal value: Negative mg/dL\nValue\nNegativeProtein, UA\nNormal value: Negative mg/dL\n"
  },
  {
    "filename": "UCSF MyChart - Test Details.pdf",
    "uploaded_at": 1765830018.5582144,
    "summary": "Hi James! This is your CT scan report from UCSF dated June 30, 2025 - a follow-up scan to monitor that mesenteric lymph node Dr. Moore was keeping an eye on.\n\nI have some really good news for you! The lymph node that was concerning your doctor has actually gotten smaller - it went from 11mm down to just 6mm, which is exactly what we want to see. Your post-surgical anatomy from your previous Whipple procedure looks stable and unremarkable, which is also great news.\n\n**Key findings in plain English:**\n- **The main concern (mesenteric lymph node) is improving** - it shrunk from 11mm to 6mm\n- **New finding:** There's a small 7mm nodule in your left lung that wasn't there in 2023, but it's been stable for the past month\n- **Everything else looks good** - your surgical sites are healing well, liver lesions are stable, and no other concerning findings\n- **Follow-up needed:** Dr. Moore recommends repeating imaging in about a year to keep monitoring that lung nodule, which is a very reasonable and cautious approach given your medical history\n\nDr. Moore's note confirms this is mostly good news - the thing she was most worried about (the lymph node) is getting better! The lung nodule is something to monitor but not panic about, especially since it's been stable recently.",
    "raw_text_preview": "Name: James R Anderson | DOB: 8/20/1978 | MRN: 51098153 | PCP: Kendra Ann Moore, MD | Legal Name: James R Anderson\nCT Abdomen /Pelvis with Contrast\nResults\n \n \n \nThe imaging provider, Omar Tariq Hassan, MD, reviewed your images and created this report \nto communicate with your care team. Your care team may not have yet reviewed this report \nbut will discuss these results with you at your next visit, through telephone, or MyChart \nmessaging.  If you do not have a visit scheduled and wish to sched"
  }
]